a,b
X,Y
©
ß
q0,q1,q2,q3,q4,q5,q6
q0
q6
q0,©,,q1,©,D,,,q1,Y,,q4,Y,D,,,q1,a,,q2,X,D,,,q1,b,,q4,X,D,,,q1,ß,,q6,ß,E,,,q2,X,,q2,X,D,,,q2,Y,,q2,Y,D,,,q2,a,,q2,a,D,,,q2,b,,q2,b,D,,,q2,ß,,q3,Y,E,,,q3,X,,q1,X,D,,,q3,Y,,q3,Y,E,,,q3,a,,q3,a,E,,,q3,b,,q3,b,E,,,q4,Y,,q4,Y,D,,,q4,b,,q4,Y,D,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,b,,q4,Y,D,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,Y,,q4,Y,D,,,q4,b,,q4,Y,D,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,b,,q4,Y,D,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,,,,q4,ß,,q5,ß,E,,,q5,X,,q5,a,E,,,q5,Y,,q5,a,E,,,q5,a,,q5,a,E,,,q5,©,,q6,©,D,,,
